# coding: utf-8

# PEP-8

"""
6.Реализовать функцию int_func(), принимающую слово из маленьких латинских букв
и возвращающую его же, но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
Продолжить работу над заданием. В программу должна попадать строка из слов,
разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре.
Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
Необходимо использовать написанную ранее функцию int_func().
"""
def int_func(str1):
    """
    Функция возвращает строку с первой прописной буквой
    :param str1: str
    :return: str
    """
    str1 = str1.title()
    return str1

text = int_func('text')
print(text)  # вывод
text = "the early bird catches the worm"
"""
делает из строки список и в цикле заменяет каждое "слово" на "Слово"
"""
text = [int_func(e) for i, e in enumerate(text.split())]
text =" ".join(text)  # собираем список слов в строку
print(text)  # вывод